Failed to reproduce in macOS:

```bash
$ terragrunt plan
10:07:58.621 INFO   tofu: Initializing the backend...
10:07:58.621 INFO   tofu: Initializing provider plugins...
10:07:58.621 INFO   tofu: - Finding latest version of hashicorp/local...
10:07:59.045 INFO   tofu: - Installing hashicorp/local v2.5.2...
10:07:59.333 INFO   tofu: - Installed hashicorp/local v2.5.2 (signed, key ID 0C0AF313E5FD9F80)
10:07:59.333 INFO   tofu: Providers are signed by their developers.
10:07:59.333 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
10:07:59.333 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
10:07:59.333 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
10:07:59.334 INFO   tofu: selections it made above. Include this file in your version control repository
10:07:59.334 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
10:07:59.334 INFO   tofu: you run "tofu init" in the future.
10:07:59.334 INFO   tofu: OpenTofu has been successfully initialized!
10:07:59.334 INFO   tofu:
10:07:59.334 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
10:07:59.334 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
10:07:59.334 INFO   tofu: should now work.
10:07:59.334 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
10:07:59.334 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
10:07:59.334 INFO   tofu: commands will detect it and remind you to do so if necessary.
10:07:59.649 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
10:07:59.649 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
10:07:59.649 STDOUT tofu:   + create
10:07:59.649 STDOUT tofu: OpenTofu will perform the following actions:
10:07:59.649 STDOUT tofu:   # local_file.file will be created
10:07:59.649 STDOUT tofu:   + resource "local_file" "file" {
10:07:59.649 STDOUT tofu:       + content              = "testing = value"
10:07:59.649 STDOUT tofu:       + content_base64sha256 = (known after apply)
10:07:59.649 STDOUT tofu:       + content_base64sha512 = (known after apply)
10:07:59.649 STDOUT tofu:       + content_md5          = (known after apply)
10:07:59.649 STDOUT tofu:       + content_sha1         = (known after apply)
10:07:59.649 STDOUT tofu:       + content_sha256       = (known after apply)
10:07:59.649 STDOUT tofu:       + content_sha512       = (known after apply)
10:07:59.649 STDOUT tofu:       + directory_permission = "0777"
10:07:59.649 STDOUT tofu:       + file_permission      = "0777"
10:07:59.649 STDOUT tofu:       + filename             = "./hi.txt"
10:07:59.649 STDOUT tofu:       + id                   = (known after apply)
10:07:59.649 STDOUT tofu:     }
10:07:59.649 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
10:07:59.649 STDOUT tofu:
10:07:59.649 STDOUT tofu: ─────────────────────────────────────────────────────────────────────────────
10:07:59.649 STDOUT tofu: Note: You didn't use the -out option to save this plan, so OpenTofu can't
10:07:59.649 STDOUT tofu: guarantee to take exactly these actions if you run "tofu apply" now.
```

```bash
$ terragrunt apply
10:08:19.766 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
10:08:19.766 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
10:08:19.766 STDOUT tofu:   + create
10:08:19.766 STDOUT tofu: OpenTofu will perform the following actions:
10:08:19.766 STDOUT tofu:   # local_file.file will be created
10:08:19.766 STDOUT tofu:   + resource "local_file" "file" {
10:08:19.766 STDOUT tofu:       + content              = "testing = value"
10:08:19.766 STDOUT tofu:       + content_base64sha256 = (known after apply)
10:08:19.766 STDOUT tofu:       + content_base64sha512 = (known after apply)
10:08:19.766 STDOUT tofu:       + content_md5          = (known after apply)
10:08:19.766 STDOUT tofu:       + content_sha1         = (known after apply)
10:08:19.766 STDOUT tofu:       + content_sha256       = (known after apply)
10:08:19.766 STDOUT tofu:       + content_sha512       = (known after apply)
10:08:19.766 STDOUT tofu:       + directory_permission = "0777"
10:08:19.766 STDOUT tofu:       + file_permission      = "0777"
10:08:19.766 STDOUT tofu:       + filename             = "./hi.txt"
10:08:19.766 STDOUT tofu:       + id                   = (known after apply)
10:08:19.766 STDOUT tofu:     }
10:08:19.766 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
10:08:19.766 STDOUT tofu:
10:08:19.766 STDOUT tofu: Do you want to perform these actions?
10:08:19.766 STDOUT tofu:   OpenTofu will perform the actions described above.
10:08:19.766 STDOUT tofu:   Only 'yes' will be accepted to approve.
10:08:19.766 STDOUT tofu:   Enter a value:
yes
10:08:22.306 STDOUT tofu: local_file.file: Creating...
10:08:22.307 STDOUT tofu: local_file.file: Creation complete after 0s [id=8c1a5e903a3f10119839409a4fb9b7d08ccec07e]
10:08:22.312 STDOUT tofu:
10:08:22.312 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
10:08:22.312 STDOUT tofu:
```

```bash
$ bat hi.txt
───────┬───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
       │ File: hi.txt
───────┼───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
   1   │ testing = value
───────┴───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────
```